print("เลือกรูปทรงที่ต้องการคำนวณ:")
print("1. สี่เหลี่ยมมุมฉาก  2. สามเหลี่ยม  3. วงกลม")
เมนู = input("เลือกเบอร์ (1-3): ")

if เมนู == "1":
    กว้าง = float(input("ป้อนความกว้าง: "))
    ยาว = float(input("ป้อนความยาว: "))
    พื้นที่ = กว้าง * ยาว
    print("พื้นที่สี่เหลี่ยมคือ:", พื้นที่)

elif เมนู == "2":
    ฐาน = float(input("ป้อนความยาวฐาน: "))
    สูง = float(input("ป้อนความสูง: "))
    พื้นที่ = 0.5 * ฐาน * สูง
    print("พื้นที่สามเหลี่ยมคือ:", พื้นที่)

elif เมนู == "3":
    รัศมี = float(input("ป้อนความยาวรัศมี: "))
    พื้นที่ = 3.14 * (รัศมี ** 2)
    print("พื้นที่วงกลมคือ:", พื้นที่)

else:
    print("เลือกเมนูไม่ถูกต้อง")